adityaxavier/OB1203_br/OB1203RL78L13/r_iic_drv_rl78/r_iic_drv_sfr_rl78l13.c
            /* Please add a channel as needed. */

        break;
    }

    return Ret;
}


/********************************************************************************************************************
* Outline       : Check SCL Level Processing
* Function Name : r_iic_drv_check_scl_level
* Description   : Checks SCL level from high to low.
* Arguments     : r_iic_drv_info_t * pRIic_Info     ;   IIC Information
* Return Value  : R_IIC_TRUE                        ;   SDA = High
*               : R_IIC_FALSE                       ;   SDA = Low
*********************************************************************************************************************/
bool r_iic_drv_check_scl_level(r_iic_drv_info_t * pRIic_Info)
{
    uint16_t cnt = 0;
    
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL1   = IICCTL1_ADR(pRIic_Info->ChNo);
    
    for (cnt = SCLCHK_CNT; cnt > 0; cnt--)
    {
        if (R_IIC_MSK_CLD != (*pcIICCTL1 & R_IIC_MSK_CLD))
        {
            return R_IIC_TRUE;
        }
    }
    
    return R_IIC_FALSE;
}


/********************************************************************************************************************
* Function Name : r_iic_drv_check_bus_busy
* Description   : Checks bus busy.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : R_IIC_TRUE                        ;   Bus Ready
*               : R_IIC_FALSE                       ;   Bus Busy
*********************************************************************************************************************/
bool r_iic_drv_check_bus_busy(r_iic_drv_info_t *pRIic_Info)
{
    bool        Ret = R_IIC_TRUE;
    uint32_t    Cnt;

    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL1   = IICCTL1_ADR(pRIic_Info->ChNo);
    volatile uint8_t * const    pcIICF      = IICF_ADR(pRIic_Info->ChNo);

    /* Checks bus busy. */
    for(Cnt = BUSCHK_CNT; Cnt > 0; Cnt--)
    {
        /* Bus busy? */
        if ((R_IIC_MSK_IICBSY != (*pcIICF & R_IIC_MSK_IICBSY))  &&
            (R_IIC_MSK_CLDDAD == (*pcIICCTL1 & R_IIC_MSK_CLDDAD)))              /* IICBSY = 0, CLD = 1, DAD = 1     */
        {
            break;                                              /* Bus ready                                        */
        }
    }

    /* Counter limit? */
    if (0 == Cnt)
    {
        Ret = R_IIC_FALSE;                                      /* Bus busy                                         */
    }

    return Ret;

}


/********************************************************************************************************************
* Function Name : r_iic_drv_per_enable
* Description   : Clock is supplied permission to IIC peripheral hardware.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_per_enable(r_iic_drv_info_t *pRIic_Info)
{
    /* Channel number? */
    switch (pRIic_Info->ChNo)
    {
        case 0U:
#ifdef IICA0_ENABLE
            R_IIC_IICA0EN = 1U;                                 /* IICA0 enables input clock supply.                */
#endif /* #ifdef IICA0_ENABLE */
        break;
    
        default:
        
            /* Please add a channel as needed. */
        
        break;
    }
}

/********************************************************************************************************************
* Function Name : r_iic_drv_start_cond_generate
* Description   : Start condition generation
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_start_cond_generate(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);

    /* Start condition generation. */
    *pcIICCTL0 |= R_IIC_IICCTL0_ST;                             /* Sets a STT bit.                                  */
}

/********************************************************************************************************************
* Function Name : r_iic_drv_stop_cond_generate
* Description   : Stop condition generation
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : None
*********************************************************************************************************************/
void r_iic_drv_stop_cond_generate(r_iic_drv_info_t *pRIic_Info)
{
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICCTL0   = IICCTL0_ADR(pRIic_Info->ChNo);
    
    /* Stop condition generation. */
    *pcIICCTL0 |= R_IIC_IICCTL0_SP;                             /* Set a SPT bit.                                   */

}


/********************************************************************************************************************
* Function Name : r_iic_drv_start_cond_check
* Description   : Checks start condition generation.
* Arguments     : r_iic_drv_info_t *pRIic_Info      ;   IIC Information
* Return Value  : R_IIC_TRUE                        ;   Detects start condition
*               : R_IIC_FALSE                       ;   Not detects start condition
*********************************************************************************************************************/
bool r_iic_drv_start_cond_check(r_iic_drv_info_t *pRIic_Info)
{
    bool        Ret = R_IIC_TRUE;
    uint16_t    Cnt;
    
    /* Creates the register pointer for the selected IICA channel. */
    volatile uint8_t * const    pcIICS      = IICS_ADR(pRIic_Info->ChNo);
    
    /* Waits Start Condition generation. */
    for (Cnt = START_COND_WAIT; Cnt > 0; Cnt--)
    {
        /* Sets STD bit? */
        if (R_IIC_MSK_STD == (*pcIICS & R_IIC_MSK_STD))
        {
            break;                                              /* Successful                                       */
        }
    }

    /* Counter limit? */
    if (0 == Cnt)                                               /* Failed start condition generation                */
    {
        Ret = R_IIC_FALSE;                                      /* Error                                            */
    }

    return Ret;
}

